In [1]:
import pandas as pd
import os

In [2]:
full_student_data= os.path.join(r'C:\Users\gasco\OneDrive\Desktop\Module 4 Challenge\new_full_student_data.csv')
student_df = pd.read_csv(full_student_data)
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [3]:
# Check for null values

In [4]:
student_df.isna().sum()

student_id          0
student_name        0
grade               0
school_name         0
reading_score    1968
math_score        982
school_type         0
school_budget       0
dtype: int64

In [5]:
# Drop rows with null values and verify removal

In [6]:
student_df = student_df.dropna()
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [7]:
# Check for duplicated rows

In [8]:
student_df.duplicated().sum()

1836

In [9]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [10]:
# Check data types

In [11]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [12]:
# Examine the grade column to understand why it is not an int

In [13]:
student_df['grade']

0         9th
1         9th
2         9th
3         9th
5         9th
         ...
19508    10th
19509    12th
19511    11th
19512    11th
19513    12th
Name: grade, Length: 14831, dtype: object

In [14]:
# Remove the non-numeric characters and verify the contents of the column

In [15]:
student_df['grade']= student_df['grade'].str.replace('th','')

In [16]:
student_df['grade']=student_df['grade'].astype('int64')

In [17]:
student_df.dtypes

student_id         int64
student_name      object
grade              int64
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [18]:
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: int64

In [19]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9,Silva High School,69.7,80.3,Public,991918
5,74579444,Cynthia Johnson,9,Montgomery High School,63.5,76.9,Charter,893368

In [20]:
#Generate the summary statistics for each DataFrame by using the describe function

In [21]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [22]:
# Display the mean math score by using the mean function

In [23]:
student_df.mean(numeric_only=True)

student_id       6.975296e+07
grade            1.035554e+01
reading_score    7.235787e+01
math_score       6.467573e+01
school_budget    8.937427e+05
dtype: float64

In [24]:
# Display the mean math score by using the mean function.

In [25]:
math_score_df = student_df['math_score'].mean()
math_score_df

64.67573326141189

In [26]:
# Store the minimum reading score in min_reading_score

In [27]:
min_reading_score_df = student_df['reading_score'].min()
min_reading_score_df

10.5

In [28]:
student_df.iloc[0:3, 3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [29]:
# Select the rows for Grade 9, and display their summary statistics by using loc and describe

In [30]:
nine_grade_df = student_df.loc[student_df["grade"] == 9]
nine_grade_df.describe()

         student_id   grade  reading_score   math_score  school_budget
count  4.132000e+03  4132.0    4132.000000  4132.000000    4132.000000
mean   6.979441e+07     9.0      69.236713    66.585624  898692.606002
std    3.470565e+07     0.0      15.277354    16.661533   54891.596611
min    1.000906e+07     9.0      17.900000     5.300000  817615.000000
25%    3.953848e+07     9.0      59.000000    56.000000  846745.000000
50%    6.984037e+07     9.0      70.050000    67.800000  893368.000000
75%    9.939504e+07     9.0      80.500000    78.500000  957299.000000
max    1.299997e+08     9.0      99.900000   100.000000  991918.000000

In [31]:
# Store the row with the minimum overall reading score in min_reading_row by using loc and the min_reading_score variable from Deliverable 3, as the following image shows

In [32]:
min_reading_score_df = student_df["reading_score"].min()
min_reading_row = student_df[student_df["reading_score"] == min_reading_score_df]
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [33]:
# Select all the reading scores from the 10th graders at Dixon High School by using loc with conditionals, as the following image shows:

In [34]:
student_df.loc[(student_df["school_name"] == "Dixon High School") & (student_df["grade"] == 10)].iloc[ 0:, 3:5]

             school_name  reading_score
45     Dixon High School           71.1
60     Dixon High School           59.5
69     Dixon High School           88.6
94     Dixon High School           81.5
100    Dixon High School           95.3
...                  ...            ...
19283  Dixon High School           52.9
19306  Dixon High School           58.0
19344  Dixon High School           38.0
19368  Dixon High School           84.4
19445  Dixon High School           43.9

[569 rows x 2 columns]

In [35]:
# Find the mean reading score for all the students in Grades 11 and 12 combined by using conditional statements and loc or iloc.

In [36]:
ths_condition = (student_df["grade"] >= 11)
student_reading_score= student_df.loc[ths_condition,['reading_score']].mean()
student_reading_score

reading_score    74.900381
dtype: float64

In [37]:
# Display the average budget for each school type by using the groupby and mean functions, as the following image shows:

In [38]:
student_loc = student_df.loc[:]
school_budget_df = student_df.groupby(["school_type"])
school_budget_df.mean().iloc[0:2,4:]

             school_budget
school_type
Charter      872625.656236
Public       911195.558251

In [39]:
# Find the total number of students at each school, and sort those numbers from largest to smallest by using the groupby, count, and sort_values functions, as the following image shows:

In [40]:
student_count_df= student_df.groupby('school_name').student_id.count()
print(student_count_df)

school_name
Bowers High School         803
Campbell High School       407
Campos High School         541
Chang High School          171
Dixon High School         1583
Fisher High School         798
Green High School         1961
Montgomery High School    2038
Odonnell High School       459
Richard High School        551
Silva High School         1109
Sullivan High School       971
Turner High School         846
Wagner High School        1541
Woods High School         1052
Name: student_id, dtype: int64

In [41]:
student_count_df.sort_values(ascending= False)

school_name
Montgomery High School    2038
Green High School         1961
Dixon High School         1583
Wagner High School        1541
Silva High School         1109
Woods High School         1052
Sullivan High School       971
Turner High School         846
Bowers High School         803
Fisher High School         798
Richard High School        551
Campos High School         541
Odonnell High School       459
Campbell High School       407
Chang High School          171
Name: student_id, dtype: int64

In [42]:
# Find the average math score by grade for each school type by using the groupby and mean functions, as the following image shows:

In [43]:
avg_math_score_by_school_df = student_df.groupby(["school_type","grade"])
avg_math_score_by_school_df.mean().round(0).iloc[0:8, 2:3]

                   math_score
school_type grade
Charter     9            70.0
            10           66.0
            11           68.0
            12           60.0
Public      9            64.0
            10           64.0
            11           59.0
            12           64.0